In [22]:
mess=['book a cab','book a movie movie movie movie','today is a holiday']

In [32]:
from sklearn.feature_extraction.text import CountVectorizer,TfidfVectorizer

In [33]:
vect=TfidfVectorizer()

In [34]:
vect.fit_transform(mess).toarray()

array([[ 0.60534851,  0.79596054,  0.        ,  0.        ,  0.        ,
         0.        ],
       [ 0.18678528,  0.        ,  0.        ,  0.        ,  0.98240076,
         0.        ],
       [ 0.        ,  0.        ,  0.57735027,  0.57735027,  0.        ,
         0.57735027]])

In [35]:
vect.get_feature_names()

['book', 'cab', 'holiday', 'is', 'movie', 'today']

In [36]:
import pandas as pd
from pandas import DataFrame

In [37]:
data=pd.DataFrame(vect.fit_transform(mess).toarray())

In [38]:
data.head()

          0         1        2        3         4        5
0  0.605349  0.795961  0.00000  0.00000  0.000000  0.00000
1  0.186785  0.000000  0.00000  0.00000  0.982401  0.00000
2  0.000000  0.000000  0.57735  0.57735  0.000000  0.57735

In [39]:
data.columns=['book', 'cab', 'holiday', 'is', 'movie', 'today']

In [40]:
data.head()

       book       cab  holiday       is     movie    today
0  0.605349  0.795961  0.00000  0.00000  0.000000  0.00000
1  0.186785  0.000000  0.00000  0.00000  0.982401  0.00000
2  0.000000  0.000000  0.57735  0.57735  0.000000  0.57735